LAB 01

1.WAP to print first record from dataset.
2.WAP to display first attribute of the dataset.
3.Print all attributes of the loaded dataset.
4.calculate the average of a numeric column.
5.Add a column called age and salary to the existing dataset.
6.Split the csv file into two sub csv files.
7.filter salary column using salary>20000 condition
8.sort the data using salary column

In [21]:
import pandas as pd
import statistics as st

In [22]:
#1
data_reader=pd.read_csv("student_details.csv")
data_reader.head(1)

         Name  ROll_number  DMDW_MARKS  FLAT_MARKS  CN_MaRKS
0  ADITYA DAS            1          25          25        24

In [23]:
#2
data_reader.columns[0]

'Name'

In [24]:
#3
for i in data_reader.columns:
    print(i,end="\t",sep=",")

Name	ROll_number	DMDW_MARKS	FLAT_MARKS	CN_MaRKS

In [25]:
#4
print(f'mean of DMDW marks is:\t{float(data_reader['DMDW_MARKS'].mean())}')

mean of DMDW marks is:	25.25

In [26]:
#5
import random as rn

ages=[]
salary=[]
for i in range(0,20):
    random_ages=rn.randint(18,30)
    ages.append(random_ages)

for i in range(0,20):
    random=rn.randrange(15000,25000,2500)
    salary.append(random)

data_reader['age']=ages
data_reader['age']

data_reader['salary']=salary
data_reader['salary']

0     17500
1     15000
2     22500
3     17500
4     17500
5     17500
6     20000
7     15000
8     20000
9     20000
10    20000
11    15000
12    15000
13    15000
14    17500
15    17500
16    20000
17    15000
18    22500
19    17500
Name: salary, dtype: int64

In [27]:
#6
middle = len(data_reader)//2
csv1=data_reader.iloc[:middle]
csv2=data_reader.iloc[middle:]

csv1.to_csv("csv1.css")
csv2.to_csv("csv2.csv")

In [28]:
#7
new_data=data_reader[data_reader['salary']>20000]
print(new_data)

      Name  ROll_number  DMDW_MARKS  FLAT_MARKS  CN_MaRKS  age  salary
2   TOKITO            3          27          28        29   21   22500
18    UZUI           19          29          21        21   30   22500

In [29]:
#8
sort=data_reader.sort_values(by='salary')
print(sort)

          Name  ROll_number  DMDW_MARKS  FLAT_MARKS  CN_MaRKS  age  salary
1     ABHILASH            2          24          23        25   21   15000
7      INOSUKE            8          26          24        23   22   15000
12      SANAME           13          25          25        21   23   15000
11      OBONIA           12          21          15        29   19   15000
13      GANIYA           14          22          22        21   22   15000
17       KANAO           18          29          29        29   26   15000
3      YORICHI            4          30          30        30   21   17500
5    KOKOSHIBO            6          24          23        25   23   17500
15        GIYU           16          26          26        28   24   17500
14      GYOMEI           15          25          25        26   18   17500
4        MUZAN            5          29          29        28   20   17500
0   ADITYA DAS            1          25          25        24   30   17500
19       AKAZA           20          25          25        27   30   17500
10      NEZUKO           11          26          21        29   28   20000
8      ZENITSU            9          27          27        23   26   20000
6      TANJIRO            7          25          25        25   23   20000
16     RANGOKU           17          19          30        30   24   20000
9      MITSURI           10          21          22        30   25   20000
2       TOKITO            3          27          28        29   21   22500
18        UZUI           19          29          21        21   30   22500